### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_scheduled_query_rules_alert_v2.alert_too_much_calls_on_unlock must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "alert_too_much_calls_on_unlock" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[AUTH | io-p-itn-auth-webprof-func-01] Unexpected number of calls to unlock endpoint" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[AUTH | io-p-itn-auth-webprof-func-01] Unexpected number of calls to unlock endpoint"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.alert_too_much_invalid_codes_on_unlock must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "alert_too_much_invalid_codes_on_unlock" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[AUTH | io-p-itn-auth-webprof-func-01] Unexpected number of invalid codes to unlock endpoint" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[AUTH | io-p-itn-auth-webprof-func-01] Unexpected number of invalid codes to unlock endpoint"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_session_manager_internal.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01"
        name                                           = "io-p-weu-auth-sm-int-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (32 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              - "AzureFunctionsWebHost__hostid",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>
